from secret_santa.root import app
from secret_santa.utils.names import vocal

carols = ['Бог ся рождає, хто ж Го може знати!\n'
          'Ісус Му ім’я, Марія Му Мати!\n'
          'Тут Ангели чудяться,\n'
          'Рожденного бояться,\n'
          'А віл стоїть, трясеться,\n'
          'Осел смутно пасеться.\n'
          'Пастиріє клячуть,\n'
          'В плоти Бога бачуть,\n'
          'Тут же, тут же,\n'
          'Тут же, тут же, тут!',

          'Щедрик-ведрик,\n'
          'Дай вареник,\n'
          'Щедрик-ведрик,\n'
          'Сивий веприк.\n'
          'Із колосочка –\n'
          'Жита мисочка,\n'
          'Із снопочка –\n'
          'Ціла бочка.\n'
          'Мені – млинець,\n'
          'Грудочка кашки,\n'
          'Пару яєць.',

          'У нашій криниці\n'
          'Плавають синиці.\n'
          'А ви, молодиці,\n'
          'Печіть паляниці,\n'
          'З печі виймайте,\n'
          'Нам по пиріжку дайте.\n'
          'Щедрий вечір, добрий вечір,\n'
          'Добрим людям на здоров’я!',

          'Щедрик-ведрик,\n'
          'Толя й Петрик\n'
          'Стежку торують,\n'
          'Ходять-мандрують,\n'
          'Людям бажають\n'
          'Щастя-врожаю.',

          'Колядує,\n'
          'Ковбасу чує,\n'
          'А ще мало,\n'
          'Дайте сало.\n'
          'Сало велике,\n'
          'Тягну за лико,\n'
          'Лико порвалось,\n'
          'Сало зосталось.\n'
          'Добривечір!',

          ' - Колядуй, баране.\n'
          '– Не умію, пане.\n'
          '– У вікно, баране.\n'
          '– Так роги, пане.\n'
          '– Позбивай, баране.\n'
          '– Так болять, пане.\n'
          '– Зав’яжи, баране.\n'
          '- Та нічим, пане.\n'
          '– Я дам, баране!\n'
          '– Спасибі, пане!\n'
          'Святий вечір!']


@app.handle(intent='carol')
def carol(request, responder):
    if request.intent in ['confirmation', 'carol']:
        responder.params.target_dialogue_state = 'carol'
        responder.reply(carols)

        name = responder.frame.get('name')
        responder.reply(f'Хочеш ще, {vocal(name)}?')
    else:
        responder.reply('Ну добре.')