import random

quotes = [{'quote': 'Наш продукт прост и удобен, как баллистический гальванометр.',
           'author': 'Артем Сидорченко',
           'authorset': {'артем', 'артём', 'тьома', 'тема', 'сидорченко'}},
          {'quote': 'Чого ти з мене дрочишся?',
           'author': 'Артем Сидорченко',
           'authorset': {'артем', 'артём', 'тьома', 'тема', 'сидорченко'}},
          {'quote': 'Колеги, ми кинули всі сили на вирішення цього питання.',
           'author': 'Артем Сидорченко',
           'authorset': {'артем', 'артём', 'тьома', 'тема', 'сидорченко'}},
          {'quote': 'Не понял, заведите сторю.',
           'author': 'Микола Сєров',
           'authorset': {'cєров', 'микола серов', 'коля', 'николай'}},
          {'quote': 'Я это щас вам объясняю, но потом все 100% будет не так.',
           'author': 'Микола Сєров',
           'authorset': {'cєров', 'микола серов', 'коля', 'николай'}},
          {'quote': 'Так точно удобнее, чем нарисовано в дизайне.',
           'author': 'Микола Сєров',
           'authorset': {'cєров', 'микола серов', 'коля', 'николай'}},
          {'quote': 'Наш конек – беспринципная гибкость.',
           'author': 'Олександр Ахтирко',
           'authorset': {'ахтирко', 'саша', 'саня', 'ахтырко', 'александр'}},
          {'quote': 'Мы используем всю МОЩЬ контакт-центра Cisco.',
           'author': 'Олександр Ахтирко',
           'authorset': {'ахтирко', 'саша', 'саня', 'ахтырко', 'александр'}},
          {'quote': 'Да, у нас это уже готово и даже оттестировано.',
           'author': 'Олександр Ахтирко',
           'authorset': {'ахтирко', 'саша', 'саня', 'ахтырко', 'александр'}},
          {'quote': 'Ребята, это какая-то утопия.',
           'author': 'Олександр Мандриченко',
           'authorset': {'мандриченко', 'саша', 'саня', 'санек', 'саньок', 'александр', 'сашка'}},
          {'quote': 'В конце все будет хорошо. Просто это еще не конец.',
           'author': 'Олександр Мандриченко',
           'authorset': {'мандриченко', 'саша', 'саня', 'санек', 'саньок', 'александр', 'сашка'}},
          {'quote': 'По проектах у мене все, у кого які питання?',
           'author': 'Марина Швидка',
           'authorset': {'маринка', 'марина', 'швидка'}},
          {'quote': 'Кто не сдал, сдайте часы.',
           'author': 'Аліна Астахова',
           'authorset': {'алина', 'аліна', 'астахова'}},
          {'quote': 'Не знаю, треба логи дивитися.',
           'author': 'Віктор Клюй',
           'authorset': {'віктор', 'вітя', 'вітьок', 'клюй', 'витя'}},
          {'quote': 'Робив – зробив.',
           'author': 'Олег Монастирський',
           'authorset': {'олег', 'олежка', 'монастирський', 'монастырский'}},
          {'quote': 'На любой вопрос - любой ответ.',
           'author': 'Олександр Ахтирко',
           'authorset': {'ахтирко', 'саша', 'саня', 'ахтырко', 'александр'}},
          ]

def get_quote():
    return random.choice(quotes)

def author_guessed(text, quote):
    for word in text.lower().split():
        if word in quote['authorset']:
            return True
    return False